results/run-threshold-pass.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script-threshold.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m00.9s/1m0s

running (0m01.9s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m01.9s/1m0s

running (0m02.9s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m02.9s/1m0s

running (0m03.9s), 30/30 VUs, 3 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m03.9s/1m0s

running (0m04.9s), 30/30 VUs, 21 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m04.9s/1m0s

running (0m05.9s), 30/30 VUs, 43 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m05.9s/1m0s

running (0m06.9s), 30/30 VUs, 62 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m06.9s/1m0s

running (0m07.9s), 30/30 VUs, 79 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m07.9s/1m0s

running (0m08.9s), 30/30 VUs, 99 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m08.9s/1m0s

running (0m09.9s), 30/30 VUs, 115 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m09.9s/1m0s

running (0m10.9s), 30/30 VUs, 135 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m10.9s/1m0s

running (0m11.9s), 30/30 VUs, 156 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m11.9s/1m0s

running (0m12.9s), 30/30 VUs, 177 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m12.9s/1m0s

running (0m13.9s), 30/30 VUs, 195 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m13.9s/1m0s

running (0m14.9s), 30/30 VUs, 218 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m14.9s/1m0s

running (0m15.9s), 30/30 VUs, 230 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m15.9s/1m0s

running (0m16.9s), 30/30 VUs, 251 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m16.9s/1m0s

running (0m17.9s), 30/30 VUs, 271 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m17.9s/1m0s

running (0m18.9s), 30/30 VUs, 290 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m18.9s/1m0s

running (0m19.9s), 30/30 VUs, 305 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m19.9s/1m0s

running (0m20.9s), 30/30 VUs, 324 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m20.9s/1m0s

running (0m21.9s), 30/30 VUs, 345 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m21.9s/1m0s

running (0m22.9s), 30/30 VUs, 366 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m22.9s/1m0s

running (0m23.9s), 30/30 VUs, 383 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m23.9s/1m0s

running (0m24.9s), 30/30 VUs, 402 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m24.9s/1m0s

running (0m25.9s), 30/30 VUs, 421 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m25.9s/1m0s

running (0m26.9s), 30/30 VUs, 441 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m26.9s/1m0s

running (0m27.9s), 30/30 VUs, 456 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m27.9s/1m0s

running (0m28.9s), 30/30 VUs, 475 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m28.9s/1m0s

running (0m29.9s), 30/30 VUs, 495 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  0m29.9s/1m0s

running (0m30.9s), 30/30 VUs, 514 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  0m30.9s/1m0s

running (0m31.9s), 30/30 VUs, 532 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  0m31.9s/1m0s

running (0m32.9s), 30/30 VUs, 549 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  0m32.9s/1m0s

running (0m33.9s), 30/30 VUs, 569 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  0m33.9s/1m0s

running (0m34.9s), 30/30 VUs, 591 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  0m34.9s/1m0s

running (0m35.9s), 30/30 VUs, 609 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  0m35.9s/1m0s

running (0m36.9s), 30/30 VUs, 628 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  0m36.9s/1m0s

running (0m37.9s), 30/30 VUs, 645 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  0m37.9s/1m0s

running (0m38.9s), 30/30 VUs, 664 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  0m38.9s/1m0s

running (0m39.9s), 30/30 VUs, 684 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  0m39.9s/1m0s

running (0m40.9s), 30/30 VUs, 703 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  0m40.9s/1m0s

running (0m41.9s), 30/30 VUs, 721 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  0m41.9s/1m0s

running (0m42.9s), 30/30 VUs, 739 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  0m42.9s/1m0s

running (0m43.9s), 30/30 VUs, 760 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  0m43.9s/1m0s

running (0m44.9s), 30/30 VUs, 780 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  0m44.9s/1m0s

running (0m45.9s), 30/30 VUs, 799 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  0m45.9s/1m0s

running (0m46.9s), 30/30 VUs, 820 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  0m46.9s/1m0s

running (0m47.9s), 30/30 VUs, 840 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  0m47.9s/1m0s

running (0m48.9s), 30/30 VUs, 862 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  0m48.9s/1m0s

running (0m49.9s), 30/30 VUs, 878 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  0m49.9s/1m0s

running (0m50.9s), 30/30 VUs, 900 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  0m50.9s/1m0s

running (0m51.9s), 30/30 VUs, 916 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  0m51.9s/1m0s

running (0m52.9s), 30/30 VUs, 941 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  0m52.9s/1m0s

running (0m53.9s), 30/30 VUs, 957 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  0m53.9s/1m0s

running (0m54.9s), 30/30 VUs, 976 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  0m54.9s/1m0s

running (0m55.9s), 30/30 VUs, 996 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  0m55.9s/1m0s

running (0m56.9s), 30/30 VUs, 1017 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  0m56.9s/1m0s

running (0m57.9s), 30/30 VUs, 1037 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  0m57.9s/1m0s

running (0m58.9s), 30/30 VUs, 1056 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  0m58.9s/1m0s

running (0m59.9s), 30/30 VUs, 1075 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  0m59.9s/1m0s

running (1m00.9s), 11/30 VUs, 1095 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  1m0s

running (1m01.9s), 02/30 VUs, 1104 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1117' p(95)=1.1s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1106    17.804817/s
    checks_succeeded...: 100.00% 1106 out of 1106
    checks_failed......: 0.00%   0 out of 1106

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=282.85ms min=55.01ms med=222.91ms max=2.66s p(90)=748ms p(95)=1.1s
      { expected_response:true }...: avg=282.85ms min=55.01ms med=222.91ms max=2.66s p(90)=748ms p(95)=1.1s
    http_req_failed................: 0.00%  0 out of 2212
    http_reqs......................: 2212   35.609633/s

    EXECUTION
    iteration_duration.............: avg=1.64s    min=1.27s   med=1.51s    max=5.73s p(90)=2.2s  p(95)=2.4s
    iterations.....................: 1106   17.804817/s
    vus............................: 2      min=2         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 4.3 MB 69 kB/s
    data_sent......................: 204 kB 3.3 kB/s



running (1m02.1s), 00/30 VUs, 1106 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  1m0s